{
  "appTitle": "Creature Bank Editor for Heroes 3: ERA",
  "installPwa": "Install PWA App",
  "darkTheme": "Dark Theme",
  "lightTheme": "Light Theme",
  "currentLanguage": "English",
  "browserSupport": "Primarily supported in Chromium-based browsers (Chrome, Edge, Opera, etc.). Firefox, Safari, and others work with limitations.",
  "objectParameters": "Object parameters",
  "requiredFields": "Required Fields",
  "optionalFields": "Optional Fields",
  "saveFile": "Save File",
  "showJsonCode": "Show JSON Code",
  "hideJsonCode": "Hide JSON Code",
  "fieldLabels": {
    "subtype": "subtype",
    "value": "value",
    "density": "density",
    "properties": "properties",
    "enabled": "enabled",
    "name": "name",
    "sound": "sound",
    "enter": "enter",
    "loop": "loop",
    "states": "states",
    "spells": "spells",
    "morale": "morale",
    "luck": "luck",
    "spellPoints": "spellPoints",
    "experience": "experience",
    "id": "id",
    "bits": "bits",
    "flags": "flags",
    "levels": "levels",
    "schools": "schools",
    "skills": "skills",
    "primary": "primary",
    "artifactTypeCounts": "artifactTypeCounts",
    "chance": "chance",
    "creatureRewardCount": "creatureRewardCount",
    "creatureRewardType": "creatureRewardType",
    "guardians": "guardians",
    "count": "count",
    "type": "type",
    "resources": "resources",
    "upgrade": "upgrade"
  },
  "helpTexts": {
    "objectType": "The numeric type key for the object. This parameter does not change.",
    "objectSubtype": "The numeric subtype key for the object.",
    "value": "The numeric value of the creature bank. This determines the overall bank value for random map generation.",
    "density": "Determines the density of creatures in the bank. Higher values make the bank more likely to appear in RMG.",
    "properties": "Special properties of the creature bank, including visual appearance, mask definitions, and other settings.",
    "enabled": "Determines if the creature bank is enabled for random map generation.",
    "name": "The display name of the creature bank that appears when players interact with it.",
    "sound": "Sound files associated with the creature bank interactions.",
    "soundEnter": "The .wav file played when a player enters the creature bank.",
    "soundLoop": "The .wav file played in a loop while the player is interacting with the bank.",
    "states": "Different states of the creature bank (0-3) that are randomly selected at map start. Each state can define different rewards and guardians.",
    "statesMorale": "Morale modifier for the state (values from -3 to 3; positive values boost morale).",
    "statesLuck": "Luck modifier for the state (values from -3 to 3; positive values boost luck).",
    "spells": "Spells that can be acquired from the creature bank. Up to 4 spells can be defined per state.",
    "spellsId": "ID number of the spell, corresponds to spell identifiers in Heroes 3.",
    "spellsBits": "Configuration parameters for random spell generation, including schools, levels, and flags.",
    "bitsFlags": "Special flag bits affecting spell behavior (value range: 1-4294967295).",
    "bitsLevels": "Spell level configuration (value range: 1-31). For example, to allow levels 2 and 3 use 12 (2^2 + 2^3).",
    "bitsSchools": "Magic schools associated with the spell (1-Fire, 2-Water, 4-Air, 8-Earth). Combine values to select multiple schools.",
    "spellPoints": "Amount of spell points granted by the creature bank after looting.",
    "experience": "Amount of experience points granted by the creature bank after looting.",
    "skills": "Hero skills that can be granted by the creature bank.",
    "skillsPrimary": "Primary skills values in order: Attack, Defense, Power, Knowledge. Specify how many points are added to each.",
    "artifactTypeCounts": "Number of random artifacts by rarity type. Array of 4 numbers for: valuable, minor, major, and relic artifacts.",
    "chance": "Probability of this state being chosen (percentage, 0-100). The sum of chances for all states should equal 100.",
    "creatureRewardCount": "Number of creatures awarded as reward.",
    "creatureRewardType": "Creature type ID for the reward (-1 means no creature reward).",
    "guardians": "Configuration for guardian creatures defending the bank.",
    "guardiansCount": "Number of each guardian creature type. Array of 7 numbers representing the quantity of each guardian type.",
    "guardiansType": "Creature type IDs for the guardians. Array of 7 numbers, use -1 for empty slots.",
    "resources": "Resources awarded when completing the bank, in order: wood, ore, mercury, sulfur, crystal, gems, gold, mithril.",
    "upgrade": "Chance for upgraded versions of guardians (percentage, 0-100)."
  }
}